HenrikSte/esp32msi/src/main.cpp
//#define CORE_DEBUG_LEVEL ARDUHAL_LOG_LEVEL_DEBUG
//#define DEBUG_ESP_HTTP_SERVER
#include <fs.h>
#include <SPIFFS.h>
#include <ArduinoJson.h>
//#include <DNSServer.h>
//#include <WiFiManager.h>         
//#include "SSD1306.h"
//#include "SSD1306Wire.h" // legacy include: `#include "SSD1306.h"`
#include <U8g2lib.h>
#include <Wire.h> 
#include <LiquidCrystal_I2C.h>
#include <DHT.h>
#include <RtcDS3231.h>
//#include <ESP8266WebServer.h>
#include <BME280I2C.h>
#include <driver/adc.h>
//#include <AsyncTCP.h>
//#include <Hash.h>
//#include <ESPAsyncWebServer.h>

#include <ESP8266TrueRandom.h> 

#include <tinyxml2.h>

#include "orderparametermessage.h"
#include "AnalogPHMeter.h"
#include "roomlabel.h"
#include "ph.h"
#include "exceptionmessage.h"
#include "QueueArray.h"

#include "myAutoConnect.h"

/*
#define XML  "application/xml\r\n"
#define JSON "application/json\r\n"
#define PAGE "text/html\r\n"
*/

#define MYIP        "{{MyIp}}"
#define TEXT        "{{Text}}"
#define SUCCESS     "{{Success}}"
#define CODE        "{{Code}}"
#define MESSAGENAME "{{MessageName}}"
#define MESSAGEURI  "{{MessageUri}}"
#define LINKS       "{{Links}}"
#define DEVICEINFO  "{{DeviceInfo}}"

#define ADDRESS_LCD1   0x3F
#define ADDRESS_LCD2   0x27

#define ADDRESS_OLED   0x3C
#define ADDRESS_BME280 0x76
#define ADDRESS_RTC    0x68


/*

//esp8266
#define DHTPIN 7
#define TRIGGER_PIN  2
#define SDA_PIN 6
#define SCL_PIN 5
*/

//ESP32
#define DHT_PIN       23
#define TRIGGER_PIN1  21
#define TRIGGER_PIN2  22

#define SDA_PIN       19
#define SCL_PIN       18

#ifndef LED_BUILTIN
  #define LED_BUILTIN 2
#endif

#define UTC_OFFSET -2 //hours

#define LCDMAXCHARS 20
#define SENSORREADINTERVAL     5000
#define WATCHDOGTIME         120000 
#define DISPLAYUPDATEINTERVAL   200
#define MIN_FREE_SPIFFS      100000
#define LOGBUFFERSIZE         10000
#define MAXLOGFILESIZE       300000

using namespace tinyxml2;

float temperature = 0;
float humidity    = 0;
float pressure    = 0;


QueueArray<String> sendQueue;


RoomLabel roomLabel(LCDMAXCHARS);

PHMeter   pHMeter;


//works for my SSD1306 as well!
U8G2_SH1106_128X64_NONAME_F_HW_I2C * displayOled;
LiquidCrystal_I2C * displayLcd  =0;
DHT                 dht;
RtcDS3231<TwoWire>  rtc(Wire);
BME280I2C           bme;    // Default : forced mode, standby time = 1000 ms
                            // Oversampling = pressure ×1, temperature ×1, humidity ×1, filter off,

bool rtcExists = false;
bool bmeExists = false;
bool dhtExists = false;
bool pHExists  = false;
bool Lcd1Exists = false;
bool Lcd2Exists = false;
bool OledExists  = false;

enum eTypeOfDevice {eUnknown, 
                    eRoomLabel,
                    epH,
                    eScale};

eTypeOfDevice myType = eUnknown;

RtcDateTime compiled = RtcDateTime(__DATE__, __TIME__);

bool setupComplete = false;

unsigned long lastPasXInteraction = 0;
unsigned long pasXWatchDogTime    = WATCHDOGTIME;
String lastExceptionBatchID;
unsigned long lastExceptionSent=0;
const unsigned long exceptionSendInterval = 60000; //milliseconds

String logString;
bool logActive = false;

//WiFiServer server(80);     // std
//AsyncWebServer server(80); // async
WebServer server(80); 

//byte uuidNumber[16]; // UUIDs in binary form are 16 bytes long

const char PROGMEM configFileName[]  = "/config.json";
const char PROGMEM logFileName[]     = "/log.txt";

const char PROGMEM receivedMessageFileName[] = "/receivedmessage.xml";
const char PROGMEM sentMessageFileName[] = "/sentmessage.xml";

//const char PROGMEM pHCalibFileName[] = "/pHcalib.json";

bool ledStatus = false;

const char PROGMEM cStaticIp[16] = "192.168.178.254";
const char PROGMEM cStaticGw[16] = "10.0.1.1";
const char PROGMEM cStaticSn[16] = "255.255.255.0";

const char PROGMEM ApIp[]       = "192.168.4.1";
const char PROGMEM ApSsid[]     = "WerumMsiAP";
const char PROGMEM ApInfoText[] = "Config mode";


String staticIp(cStaticIp);
String staticGateway(cStaticGw);
String staticSubnetMask(cStaticSn);


const char PROGMEM token[] = "{\"access_token\": \"tfrzhjuiopiuztrdfpokiuftgzhju70987654erfgh\", \"token_type\": \"bearer\", \"expires_in\": 86399}";

const char PROGMEM transferResult[] = "<TransferResult xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\">"
                                          "<HasError>false</HasError>"
                                          "<Success>"
                                          SUCCESS
                                          "</Success>"
                                          "<Error>"
                                              "<Code>"
                                              CODE
                                              "</Code>"
                                              "<Text>"
                                              TEXT
                                              "</Text>"
                                          "</Error>"
                                      "</TransferResult>";



const char PROGMEM descriptionLink[] =  "<a href=\""
                                        MESSAGEURI
                                        "\">"
                                        MESSAGENAME
                                        "</a></p>";


const char PROGMEM mainPage[]  = 
        "<html><head>"
          "<style>"
          "table, th, td {"
              "border: 1px solid black;"
              "border-collapse: collapse;"
          "}"
          "</style>"
          "</head><body>"
         "<title>MSI embedded tech demo</title></head><body><h1>MSI embedded tech demo</h1>"
         "<p><h2>Message description</h2>"
         LINKS
         "<p><h2>Adapter config</h2></p>"
         "<p><h3>Get secure token</h3><a href=\"/getsecuretoken\">http://"
         MYIP
         "/getsecuretoken</a></p>"
         "<p><h3>Get next message</h3><a href=\"/GetNextMessage\">http://"
         MYIP
         "/GetNextMessage</a></p>"
         "<p><h3>Post message</h3><a href=\"/PostMessage\">http://"
         MYIP
         "/PostMessage</a></p>"
         "</body></html>"
         "<p><h2>Debug</h2></p>"
         "<p><a href=\"/lastsentmessage\">Last sent message</a></p>"
         "<p><a href=\"/lastreceivedmessage\">Last received message</a></p>"
         "<p><a href=\"/log\">logfile</a></p>"
         "<p><a href=\"/resetlog\">reset log file</a></p>"
         "<p><a href=\"/activatelog\">activate log</a></p>"
         "<p><a href=\"/deactivatelog\">deactivate log</a></p>"
         "<p><a href=\"/watchdog\">activate watchdog</a></p>"
         "<p><a href=\"/nowatchdog\">deactivate watchdog</a></p>"
         "<p><a href=\"/configfile\">config file</a></p>"
         "<p><a href=\"/phcalibfile\">pH Calibration file</a></p>"
         "<p><a href=\"/lcdfile\">lcd file</a></p>"
         "<p><h2>Device Info</h2>"
         DEVICEINFO
         "</body></html>"
         ;



#define countof(a) (sizeof(a) / sizeof(a[0]))
String getDateTimeString(const RtcDateTime& dt)
{
    char datestring[20];

    snprintf_P(datestring, 
            countof(datestring),
            PSTR("%04u-%02u-%02u %02u:%02u:%02u"),
            dt.Year(),
            dt.Month(),
            dt.Day(),
            dt.Hour(),
            dt.Minute(),
            dt.Second() );
    //Serial.print(datestring);
    return (String(datestring));
}

String getUTCString(const RtcDateTime& dt)
{
    char datestring[24];

    RtcDateTime UTC = dt;
    UTC = UTC+ (UTC_OFFSET *60 *60);
    

    snprintf_P(datestring, 
            countof(datestring),
            PSTR("%04u-%02u-%02u %02u:%02u:%02u,000"),
            UTC.Year(),
            UTC.Month(),
            UTC.Day(),
            UTC.Hour(),
            UTC.Minute(),
            UTC.Second() );
    //Serial.print(datestring);
    return (String(datestring));
}

String getNow()
{
  RtcDateTime now;
  if (rtcExists)
  {
     now = rtc.GetDateTime();
  }
  
