HenrikSte/esp32msi/src/main.cpp
  return getDateTimeString(now);  
}

String getUTC()
{
  RtcDateTime now;
  if (rtcExists)
  {
     now = rtc.GetDateTime();
  }
  
  return getUTCString(now);  
}

void mylog(const char * text, bool forceWrite = false)
{
  logString += text;

  if (logActive)
  {
    if (forceWrite || (logString.length() > LOGBUFFERSIZE))
    {
      if (SPIFFS.totalBytes()-SPIFFS.usedBytes() > MIN_FREE_SPIFFS)
      {
        File f = SPIFFS.open(logFileName, "a");
        if (!f) 
        {
          Serial.println("Failed to open log file for writing");
        }
        else
        {
          if (f.size()<MAXLOGFILESIZE)
          {
            f.print(logString.c_str());
            f.close();
          }
        }
      }
      else
      {
        Serial.println("SPIFFS full!");
      }
      logString="";
    }  
  }
  else
  {
    // check for string overflow
    if (logString.length() > LOGBUFFERSIZE)
    {
      logString = logString.substring(logString.length()-LOGBUFFERSIZE);
    }
  }
  Serial.print(text);
}

void mylog(const String& text, bool forceWrite = false)
{
  mylog(text.c_str(), forceWrite);
}

void mylog(double d, bool forceWrite = false )
{
  mylog(String(d), forceWrite);
}

void mylog(unsigned long l, bool forceWrite = false )
{
  mylog(String(l), forceWrite);
}

void mylog(bool b, bool forceWrite = false )
{
  mylog(String(b), forceWrite);
}

void mylog(int i, bool forceWrite = false )
{
  mylog(String(i), forceWrite);
}

void addTableRow(String& table, const char* col1, const char* col2)
{
  if (col1 && col2)
  {
    table += "<tr><td>";
    table += col1;
    table += "</td><td>";
    table += col2;
    table += "</td><tr>";
  }
}

void getDeviceInfo(String& deviceInfo)
{
  deviceInfo = "<table>";
  addTableRow(deviceInfo, "Software date",    getDateTimeString(compiled).c_str());
  addTableRow(deviceInfo, "RTC",              rtcExists ? "yes":"no");
  addTableRow(deviceInfo, "BME280",           bmeExists ? "yes":"no");
  addTableRow(deviceInfo, "DHT22",            dhtExists ? "yes":"no");
  addTableRow(deviceInfo, "ph Sensor",        pHExists  ? "yes":"no");
  addTableRow(deviceInfo, "LCD 1 (0x3F)",     Lcd1Exists ? "yes":"no");
  addTableRow(deviceInfo, "LCD 2 (0x27)",     Lcd2Exists ? "yes":"no");
  addTableRow(deviceInfo, "OLED",             OledExists  ? "yes":"no");
  addTableRow(deviceInfo, "Free heap",        String(ESP.getFreeHeap()).c_str());
  addTableRow(deviceInfo, "CPU Speed (MHz)",  String(ESP.getCpuFreqMHz()).c_str());
  addTableRow(deviceInfo, "Host name",        WiFi.getHostname());
  addTableRow(deviceInfo, "MAC adress",       WiFi.macAddress().c_str());
  addTableRow(deviceInfo, "IP",               WiFi.localIP().toString().c_str());
  addTableRow(deviceInfo, "SSID",             WiFi.SSID().c_str());
  addTableRow(deviceInfo, "RSSI",             String(WiFi.RSSI()).c_str());
  addTableRow(deviceInfo, "SPIFFS total",     String(SPIFFS.totalBytes()).c_str());
  addTableRow(deviceInfo, "SPIFFS used",      String(SPIFFS.usedBytes()).c_str());
  addTableRow(deviceInfo, "SPIFFS available", String(SPIFFS.totalBytes()-SPIFFS.usedBytes()).c_str());
  addTableRow(deviceInfo, "log file size",    String(SPIFFS.open(logFileName,"r").size()).c_str());
  addTableRow(deviceInfo, "log buffer size",  String(LOGBUFFERSIZE).c_str());
  addTableRow(deviceInfo, "log buffer used",  String(logString.length()).c_str());
  addTableRow(deviceInfo, "log active",       String(logActive).c_str());
  addTableRow(deviceInfo, "watchdog time (s)",  String(pasXWatchDogTime/1000).c_str());

  deviceInfo += "</table>";
}



bool readSensor()
{
  bool success = false;
  if (myType == eRoomLabel)
  {
    float temp(NAN), hum(NAN), pres(NAN);
    
    if (dhtExists)
    {
      //mylog("dht:");
      temp = dht.getTemperature();
      hum  = dht.getHumidity();
      
      //mylog(dht.getStatusString());
      
    }
    else if (bmeExists)
    {
        BME280::TempUnit tempUnit(BME280::TempUnit_Celsius);
        BME280::PresUnit presUnit(BME280::PresUnit_hPa);
      
        bme.read(pres, temp, hum, tempUnit, presUnit);
    }
    else
    {
      return success;
    }

    // only take over plausible values
    if (!isnan(temp) 
    && !isnan(hum) 
    && temp >-50.0 
    && hum  >0.0)
    {
      temperature = temp;
      humidity    = hum;
      success = true;
      if (!isnan(pres))
      {
        pressure = pres;
      }
    }
  }
  return success;
}

String getMainPage()
{
  String page = mainPage;
  String deviceInfo;
  getDeviceInfo(deviceInfo);

  page.replace(MYIP, WiFi.localIP().toString());
  page.replace(DEVICEINFO,deviceInfo);

  String links;

  if (myType == eRoomLabel)
  {
    for (int i=0; i<roomLabel.getMessageDescriptionCount(); i++)
    {
      String link = descriptionLink;
      link.replace(MESSAGEURI, String("/")+roomLabel.getMessageDescriptionId(i));
      link.replace(MESSAGENAME, roomLabel.getMessageDescriptionText(i));
      links += link;
    }
  }
  else if (myType==epH)
  {
    for (int i=0; i<pHMeter.getMessageDescriptionCount(); i++)
    {
      String link = descriptionLink;
      link.replace(MESSAGEURI, String("/")+pHMeter.getMessageDescriptionId(i));
      link.replace(MESSAGENAME, pHMeter.getMessageDescriptionText(i));
      links += link;
    }
  }
  page.replace(LINKS, links);

  return page;
}

String getTransferResultText(bool Ok, const char * errorText)
{
  String result = transferResult;
  result.replace(CODE, Ok?"0":"-1");
  result.replace(TEXT, errorText);
  result.replace(SUCCESS, Ok?"true":"false");
  return result;
}

void toggleLED()
{
  ledStatus = ! ledStatus;
  digitalWrite(LED_BUILTIN, ledStatus);
}

void getServerRequest(String& message)
{
    message += "URI: ";
    message += server.uri();
    message += "\nMethod: ";
    message += (server.method() == HTTP_GET)?"GET":"POST";
    message += "\nArguments: ";
    message += server.args();
    message += "\n";

    for (int i=0; i<server.args(); i++)
    {
      message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
    }
    message += "\nHeader: ";
    message += server.headers();
    message += "\n";
    for (int i=0; i<server.headers(); i++)
    {
      message += " " + server.headerName(i) + ": " + server.header(i) + "\n";
    }
  
