HenrikSte/esp32msi/src/main.cpp
}

void notFound()
{
  bool foundValidURI = false;

  String messageDescription;
  String systemId;

  if (myType == eRoomLabel)
  {
    systemId="Display_" OP_SYSTEMID "_System"; 
    systemId.replace(OP_SYSTEMID,String(WiFi.localIP()[3]));
    for (int i=0; i<roomLabel.getMessageDescriptionCount(); i++)
    {
      if (String(String("/")+roomLabel.getMessageDescriptionId(i)).equals(server.uri()))
      {
        foundValidURI = true;
        messageDescription = roomLabel.getMessageDescription(i);
        messageDescription.replace(OP_SYSTEMID,systemId);

        server.send(200, "text/xml", messageDescription.c_str());
      }
    }
  }
  else if (myType == epH)
  {
    if (!foundValidURI)
    {
      systemId="pH_" OP_SYSTEMID "_System"; 
      systemId.replace(OP_SYSTEMID,String(WiFi.localIP()[3]));
      for (int i=0; i<pHMeter.getMessageDescriptionCount(); i++)
      {
        if (String(String("/")+pHMeter.getMessageDescriptionId(i)).equals(server.uri()))
        {
          foundValidURI = true;
          messageDescription = pHMeter.getMessageDescription(i);
          messageDescription.replace(OP_SYSTEMID,systemId);

          server.send(200, "text/xml", messageDescription.c_str());
        }
      }
    }
  }
  if (!foundValidURI)
  {
    String message = "File Not Found\n\n";
    getServerRequest(message);

    server.send(404, "text/plain", message);
  }

}




bool readConfigFile() 
{
  File f = SPIFFS.open(configFileName, "r");
  
  if (!f) 
  {
    mylog("Configuration file not found");
    return false;
  } 
  else 
  {
    size_t size = f.size();
    // Allocate a buffer to store contents of the file.
    std::unique_ptr<char[]> buf(new char[size]);

    f.readBytes(buf.get(), size);
    f.close();
    DynamicJsonBuffer jsonBuffer;
    JsonObject& json = jsonBuffer.parseObject(buf.get());
    if (!json.success()) 
    {
      mylog(configFileName);
      mylog("JSON parseObject() failed\n");
      return false;
    }
    json.prettyPrintTo(Serial);

    if (json.containsKey("ip")) 
    {
      staticIp = (const char*)json["ip"];      
    }
    if (json.containsKey("gw")) 
    {
      staticGateway = (const char*)json["gw"];      
    }
    if (json.containsKey("sn")) 
    {
      staticSubnetMask = (const char*)json["sn"];      
    }
    
  }
  mylog("\nConfig file was successfully parsed\n");
  
  return true;
}


bool writeConfigFile() 
{
   
  mylog("Saving config file");
  DynamicJsonBuffer jsonBuffer;
  JsonObject& json = jsonBuffer.createObject();

  // JSONify local configuration parameters
  json["ip"] = staticIp.c_str();
  json["gw"] = staticGateway.c_str();
  json["sn"] = staticSubnetMask.c_str();
    
  return OrderParameterMessage::writeJsonFile(configFileName, json);
}
  
bool existsI2c(byte address)
{
  byte error;
  // The i2c_scanner uses the return value of
  // the Write.endTransmisstion to see if
  // a device did acknowledge to the address.

  Wire.beginTransmission(address);
  error = Wire.endTransmission();
  if (error == 0)
  {
    return true;
  }
  else if (error==4)
  { 
    mylog("Unknow error at address 0x");
    if (address<16)
      Serial.print("0");
    Serial.println(address,HEX);
    return false;
  }

  return false;
}

int scanI2c()
{
  byte  address;
  int nDevices;
  Serial.println("Scanning...");
  nDevices = 0;
  for(address = 1; address < 127; address++ )
  {
    if (existsI2c(address))
    {
      Serial.print("I2C device found at address 0x");
      if (address<16)
        Serial.print("0");
      Serial.print(address,HEX);
      Serial.println(" !");
      nDevices++;
    }

  }
  return nDevices;
}
//const uint8_t  * font9 = u8g2_font_crox1h_tf;
//const uint8_t  * font9 = u8g2_font_t0_11_tf; 
const uint8_t  * font9 = u8g2_font_profont11_tf ;
//const uint8_t  * font9 = u8g2_font_profont10_tf;
const uint8_t  * font20 = u8g2_font_logisoso20_tf;
const uint8_t  * font24 = u8g2_font_logisoso24_tf;
const uint8_t  * font30 = u8g2_font_logisoso30_tf;
const uint8_t  * font38 = u8g2_font_logisoso38_tf;


static void displayOledScreen(const char * SSID = NULL, const char * IP=NULL, const char* infoText=NULL)
{
  if (displayOled)
  {
    displayOled->clearBuffer();
   
    if (displayLcd || !setupComplete) //if we have an extra LCD...
    {
      // if there is a LCD, the oled is for information only,.
      // so we show all sorts of gereral information
      displayOled->setFont(font9);
      displayOled->drawStr( 00, 00, infoText ? infoText : WiFi.isConnected() ? "connected" : "connecting...");  

      displayOled->drawStr( 00, 10, "ID:");  
      displayOled->drawStr( 20, 10, WiFi.macAddress().c_str());  

      displayOled->drawStr( 00, 20, "MyIP:");
      displayOled->drawStr( 00, 30, "SSID:");  

      displayOled->drawStr( 30, 20, IP   ? IP   : WiFi.localIP().toString().c_str());
      displayOled->drawStr( 30, 30, SSID ? SSID : WiFi.SSID().c_str());  

      if (myType == eRoomLabel)
      {
        displayOled->drawStr( 0, 40, "Temp");
        displayOled->drawStr( 30, 40, String(temperature).c_str());
        displayOled->drawStr( 64, 40, "Hum");  
        displayOled->drawStr( 90, 40, String(humidity).c_str());  
      }
      else if (myType== epH)
      {
        int val = adc1_get_raw(ADC1_CHANNEL_0);
        displayOled->drawStr( 0, 40, String(val).c_str());
      }

      displayOled->drawStr(  0, 50, getNow().c_str());  

    }
    else if (myType == eRoomLabel)
    {
    
      displayOled->setFont(font24);
      displayOled->drawStr(  0, 00, "T:");
      displayOled->drawStr( 30, 00, String(temperature).c_str());
      displayOled->drawStr(  0, 40, "H:");  
      displayOled->drawStr( 30, 40, String(humidity).c_str());  

    }
    else if (myType == epH)
    {

      displayOled->setFont(font9);
      /*
      displayOled->drawStr( 00, 00, "IP:");  
      displayOled->drawStr( 20, 00, WiFi.localIP().toString().c_str());  
      */
      //unsigned int i = adc1_get_raw(ADC1_CHANNEL_0);
      /*
      unsigned long i = pHMeter.readADC();

      displayOled->drawStr( 00, 00, "ADC:");  
      displayOled->drawStr( 30, 00, String(i).c_str());  

      displayOled->drawStr( 80, 00, String(i*3770/4096).c_str());  
      */
      //displayOled->setFont(font38);
      displayOled->setFont(font20);
      displayOled->drawStr(  0, 20, "pH:");
      //displayOled->drawStr( 64, 9, pHMeter.getpHString().c_str());
      displayOled->setFont(font30);
      displayOled->drawStr( 35, 9, pHMeter.getpHString().c_str());
    }
    
    displayOled->sendBuffer();

