HenrikSte/esp32msi/src/main.cpp
  }

}

void blinkLcdScreen(unsigned long ms)
{
  displayLcd->noBacklight();
  delay(ms);
  displayLcd->backlight();
}

void displayLcdScreen(const String& line1, 
                      const String& line2, 
                      const String& line3, 
                      const String& line4, 
                      bool enabled)
{
    displayLcd->setCursor(0,0);
    displayLcd->print(line1);
    displayLcd->setCursor(0,1);
    displayLcd->print(line2);
    displayLcd->setCursor(0,2);
    displayLcd->print(line3);
    displayLcd->setCursor(0,3);
    displayLcd->print(line4);
    
    if (enabled)
    {
      displayLcd->backlight();
    }
    else
    {
      displayLcd->noBacklight();
    }

}


void displayLcdScreen(const char * SSID = NULL, const char * IP=NULL, const char* infoText=NULL)
{
  if (displayLcd)
  {
    String line1;
    String line2;
    String line3;
    String line4;
    bool enabled = true;
    if (setupComplete)
    {
      roomLabel.getLcdData(line1, line2, line3, line4, enabled);
    }
    else
    {
      line1 = roomLabel.makeLCDLine(WiFi.macAddress().c_str(),"ID:");
      line2 = roomLabel.makeLCDLine(IP       ? IP       : WiFi.localIP().toString().c_str(), "MyIP:");
      line3 = roomLabel.makeLCDLine(SSID     ? SSID     : WiFi.SSID().c_str(), "SSID:");
      line4 = roomLabel.makeLCDLine(infoText ? infoText : WiFi.isConnected() ? "connected" : "connecting...", "");
      enabled = true;
    }

    displayLcdScreen (line1, 
                      line2, 
                      line3, 
                      line4, 
                      enabled);

 /*    
    DisplayLcd.print(getDateTimeString(getNow()));
  */  
  }
}


int todo2; // show "connecting"

/*
void wifiManagerConnectCallback (WiFiManager *myWiFiManager) 
{
  mylog("\nwifiManagerConnectCallback: ");
  String SSID = myWiFiManager->getSSID();
  if (SSID.length()==0)
  {
    SSID = WiFi.SSID();
  }

  displayLcdScreen(SSID.c_str(), myWiFiManager->getIp().toString().c_str(), "Connecting...");
  displayOledScreen(SSID.c_str(), myWiFiManager->getIp().toString().c_str(), "Connecting...");
  mylog("connecting to ");
  mylog(SSID);
  mylog("IP ");
  mylog(myWiFiManager->getIp().toString());
  mylog("\n");
}
*/


bool onConfigMode(IPAddress softapip) 
{
  mylog("onConfigMode: ");
  displayLcdScreen(ApSsid, ApIp, ApInfoText);
  displayOledScreen(ApSsid, ApIp, ApInfoText);
  return true;
}

/*

void wifiManagerSaveConfigCallback () 
{
  mylog("wifiManagerSaveConfigCallback ");
  staticIp = WiFi.localIP().toString();
  staticGateway = WiFi.gatewayIP().toString();
  staticSubnetMask = WiFi.subnetMask().toString();
  writeConfigFile();
}

*/

void wifiStart()
  {
    bool forcePortal = false;
    /*
    WiFiManager WifiManager;
    
    WifiManager.setConnectCallback(wifiManagerConnectCallback);
    WifiManager.setAPCallback(wifiManagerConfigModeCallback);
    WifiManager.setSaveConfigCallback(wifiManagerSaveConfigCallback);
    WifiManager.setConfigPortalTimeout(120);

    
    //set static ip
  
    IPAddress _ip,_gw,_sn;
    _ip.fromString(staticIp);
    _gw.fromString(staticGateway);
    _sn.fromString(staticSubnetMask); 
    WifiManager.setSTAStaticIPConfig(_ip, _gw, _sn);
*/
  

    if (digitalRead(TRIGGER_PIN1) == LOW)
    {
      mylog("Forcing ConfigPortal\n");
      forcePortal = true;
    }  

/*
    do
    {
      WifiManager.autoConnect(ApSsid); 
      
      if(!WiFi.isConnected())
      {
        mylog("\n\n\nWifiManager autoconnect failed, trying again\n");
        delay(100);
        ESP.restart();
      }
    }
    while (!WiFi.isConnected());
 */

    if (!autoConnectWifi(onConfigMode, forcePortal, ApSsid))
    {
      ESP.restart();
    }



    Serial.println("back from  autoconnect");

    String hostName = String(F("MSI")) + String((unsigned long)ESP.getEfuseMac()); 

    mylog("MySSID:");
    mylog(WiFi.SSID());
    mylog("\nMyIP:");
    mylog(WiFi.localIP().toString());
    mylog("\nMyMac:");
    mylog(WiFi.macAddress());
    WiFi.setHostname(hostName.c_str());
    mylog("\nMyHostName:");
    mylog(WiFi.getHostname());
    

  }

bool processMessage(const String& content, String & errorMessage)
{   
  bool success = false;
  
  String localMessageId;
  String localDeviceTypeId;
  OrderParameterMessage::getMessageIdFromXml(content, localMessageId, localDeviceTypeId);
  mylog(localMessageId);
  if (localMessageId.length())
  {
    if (roomLabel.hasThisMessageId(localMessageId.c_str(), localDeviceTypeId.c_str()))
    {
      //Serial.print(" is a RoomLabel message, success:");
      success = roomLabel.parseXml(content, errorMessage);
      mylog(success);
      
      if (roomLabel.hasMessageToSend())
      {
        //mylog(getNow());
        
        // we ignore the fact that pressure might be NAN, handled by room label 
        String response = roomLabel.getNextMessageString(temperature, 
                                                         humidity,
                                                         pressure); 

        //Serial.print("QueueSize:");
        //Serial.print(sendQueue.count());

        //Serial.print("--push--");
        sendQueue.push(response);
        
        //Serial.print("->QueueSize:");
        //Serial.println(sendQueue.count());

        roomLabel.setHasMessageToSend(false);
        //Serial.print(getNow());
      }

    }
    else if (pHMeter.hasThisMessageId(localMessageId.c_str(), localDeviceTypeId.c_str()))
    {
      success = pHMeter.parseXml(content, errorMessage);
      mylog("phMeter.parseXml:");
      mylog(success);
      
      mylog( " hasMessageToSend:");
      if (pHMeter.hasMessageToSend())
      {
        mylog( "true");
        String response = pHMeter.getNextMessageString(); 
        sendQueue.push(response);
        pHMeter.setHasMessageToSend(false);
      }
      else
      {
        mylog( "false");
      }

    }    /*
    else if (newclass::::hasThisMessageId(messageId))
    {
      newclass.parseXml(content,errorMessage);
    }
    */
    else
    {
      errorMessage = String("The message ID \"") + localMessageId +"\" is not supported by this device.";
    }

    if (success)
    {
      //Save XML for next start
      File f = SPIFFS.open(receivedMessageFileName, "w");
      if (!f) 
      {
        mylog("Failed to open message file for writing\n");
      }
      else
      {
        f.print(content.c_str());
        f.close();
      }
    }
  }
  mylog(errorMessage);
  mylog(".\n");
  return success;
}
/*
void readXmlFromFS()
{
  File f = SPIFFS.open(receivedMessageFileName, "r");
  if (!f) 
  {
    Serial.println("receivedMessage not found");
    return;
  } 
  else 
  {
    // we could open the file
    size_t size = f.size();
    // Allocate a buffer to store contents of the file.
    std::unique_ptr<char[]> buf(new char[size+1]);

