HenrikSte/esp32msi/src/main.cpp
    if (!sendQueue.isEmpty())
    {
/*
      Serial.print(getNow());
      Serial.print("QueueSize:");
      Serial.print(sendQueue.count());
      Serial.print("--pop--");
*/      
      response = sendQueue.pop();

      //Serial.print("->QueueSize:");
      //Serial.print(sendQueue.count());

       //Save XML
      File f = SPIFFS.open(sentMessageFileName, "w");
      if (!f) 
      {
        mylog("Failed to open message file for writing");
      }
      else
      {
        f.print(response.c_str());
        f.close();
      }

    }
    else 
    {
      response = "<NoMessage/>";
    }
    toggleLED();
    server.send(200, "application/XML", response);
    mylog(".");
    lastPasXInteraction = millis();
    mylog(millis()-start);
    mylog("ms\n");
  });

  server.on("/PostMessage", HTTP_POST, [] () {
    unsigned long start = millis();
    String message = "PostMessage:";
    mylog(String("\n")+getNow() + ": ");
    mylog(start-lastPostMessage);
    mylog("ms<->");
    
    lastPostMessage = start;
    //getServerRequest(message);
    Serial.println(message);

    toggleLED();
    Serial.println(getNow());
    String errorString;
    bool Ok= false;
    if (server.args())
    {
      String xml = server.arg(0);
      int xmlStart = xml.indexOf('<');
      int xmlEnd   = xml.lastIndexOf('>');
    
      if (xmlEnd>=0 && xmlStart>=0)
      {
        xmlEnd++; //including the >
        xml = xml.substring(xmlStart, xmlEnd);
        if (xml.length()>0)
        {
          Ok = processMessage(xml, errorString);
          
          //Save XML
          File f = SPIFFS.open(receivedMessageFileName, "w");
          if (!f) 
          {
            Serial.println("Failed to open message file for writing");
          }
          else
          {
            f.print(xml.c_str());
            f.close();
          }

        }
      }
    }

    if (Ok)
    {
      displayLcdScreen();
      server.send(200, "application/XML", getTransferResultText(Ok, errorString.c_str()));
    }
    else
    {
      Serial.println(".fail");
      server.send(200, "application/XML", getTransferResultText(Ok, errorString.c_str()));
      Serial.println(errorString.c_str());
    }
    Serial.print(".");
    lastPasXInteraction = millis();
    Serial.print(millis()-start);
    Serial.println("ms");
  });

  server.onNotFound(notFound);
  server.begin();
}

void oledStart()
{

  if (existsI2c(ADDRESS_OLED) && !displayOled)
  {
    OledExists=true;

    //displayOled = new SSD1306Wire(ADDRESS_OLED, SDA_PIN, SCL_PIN);    
    displayOled = new U8G2_SH1106_128X64_NONAME_F_HW_I2C(U8G2_R0, /* reset=*/ U8X8_PIN_NONE);
    // set default font
    displayOled->setFont(font9);
    displayOled->setFontPosTop();
    mylog("Found oled\n");
  }

  if (displayOled)
  {
    displayOled->begin();
  }
}

void lcdStart()
{
  if (!displayLcd)
  {
    if (existsI2c(ADDRESS_LCD1))
    {
      Lcd1Exists=true;
      mylog("Using LCD 1\n");
      displayLcd = new LiquidCrystal_I2C(ADDRESS_LCD1,LCDMAXCHARS,4);
    }
    else if (existsI2c(ADDRESS_LCD2))
    {
      Lcd2Exists=true;
      mylog("Using LCD 2\n");
      displayLcd = new LiquidCrystal_I2C(ADDRESS_LCD2,LCDMAXCHARS,4);
    }
  }

  if (displayLcd)
  {
    displayLcd->init();
    displayLcd->backlight();
    displayLcdScreen();
  }
}

void RTCStart() 
{
  if (existsI2c(ADDRESS_RTC))
  {
    rtcExists = true;
    mylog("found RTC\n");
    rtc.Begin();
    if (!rtc.IsDateTimeValid()) 
    {
        // Common Cuases:
        //    1) first time you ran and the device wasn't running yet
        //    2) the battery on the device is low or even missing

        mylog("RTC lost confidence in the DateTime!\n");

        // following line sets the RTC to the date & time this sketch was compiled
        // it will also reset the valid flag internally unless the Rtc device is
        // having an issue

        rtc.SetDateTime(compiled);
    }

    if (!rtc.GetIsRunning())
    {
        mylog("RTC was not actively running, starting now\n");
        rtc.SetIsRunning(true);
    }

    RtcDateTime now = rtc.GetDateTime();
    if (now < compiled) 
    {
        mylog("RTC is older than compile time!  (Updating DateTime)\n");
        rtc.SetDateTime(compiled);
    }
    else if (now > compiled) 
    {
        mylog("RTC is newer than compile time. (this is expected)\n");
        mylog(getDateTimeString(now));
    }
    else if (now == compiled) 
    {
        mylog("RTC is the same as compile time! (not expected but all is fine)\n");
    }

    // never assume the Rtc was last configured by you, so
    // just clear them to your needed state
    rtc.Enable32kHzPin(false);
    rtc.SetSquareWavePin(DS3231SquareWavePin_ModeNone); 
  }
  else
  {
    mylog("NO RTC FOUND!\n");
  }
}

void dhtStart()
{
  mylog("Looking for DHT:");
  dht.setup(DHT_PIN);
  unsigned long waitUntil = millis()+1000;
  
  do
  {
    if (dht.getStatus() == dht.ERROR_NONE)
    {
      dhtExists = true;
    }
    else
    {
      mylog("#");
      dht.setup(DHT_PIN);
      toggleLED();
      delay(20);
    }
  } 
  while (!dhtExists && (millis() < waitUntil));
      
  
  mylog("dht:");
  mylog(dht.getStatusString());
  mylog("\n");
  
}

void bmeStart()
{
  unsigned long waitUntil = millis()+1000;
  bool success=false;
  do 
  {
    success = bme.begin();
    if (success)
    {
      break;
    }
    delay(200);
  } while (millis()<waitUntil);

  if (success)
  {
    switch(bme.chipModel())
    {
        case BME280::ChipModel_BME280:
          mylog("\nFound BME280 sensor!\n");
          bmeExists= true;
          break;
        case BME280::ChipModel_BMP280:
          mylog("\nFound BM_P_280 sensor!\n"); // we do not support this type
          break;
        default:
          mylog("\nFound UNKNOWN sensor! Error!\n");
    }
  }
  else
  {
    mylog("\nno BME found\n");
  }
}

