HenrikSte/esp32msi/src/main.cpp
void pHStart()
{
  adc1_config_width(ADC_WIDTH_12Bit);
  adc1_config_channel_atten(ADC1_CHANNEL_0,ADC_ATTEN_11db); 
  
  if (adc1_get_raw(ADC1_CHANNEL_0)!=0)
  {
    pHExists = true;
    Serial.println("Found pH");
  }
  pHMeter.initialize();

}



unsigned long startMillis;
void setup() 
{
 
  startMillis = millis();

  Serial.begin(115200);
  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, HIGH);

  pinMode(TRIGGER_PIN1, INPUT_PULLUP);           // set pin to input
  pinMode(TRIGGER_PIN2, INPUT_PULLUP);           // set pin to input
      

  bool result = SPIFFS.begin();
  mylog(String(" SPIFFS opened: ") + String(result) + "\n");

  mylog(WiFi.macAddress().c_str());
  mylog("\n");


  Wire.begin(SCL_PIN, SDA_PIN);
  mylog("\n-- scanI2c --\n");
  int nDevices = scanI2c();

  if (!nDevices)
  {
    mylog("no devices found, trying again with swapped pins...\n");
    Wire.begin(SDA_PIN,SCL_PIN);
    mylog("\n-- scanI2c --\n");
    scanI2c();
  }
  

  RTCStart();
  bmeStart();
  if (!bmeExists)
  {
    dhtStart();
  }
  pHStart();

  if (bmeExists || dhtExists)
  {
    myType = eRoomLabel;
    if (bmeExists)
    {
      roomLabel.setVersion(2);
    }
    else
    {
      roomLabel.setVersion(1);
    }
  }
  else if (pHExists)
  {
    myType = epH;
  }

  readSensor();

  oledStart();
  lcdStart();

    // Mount the filesystem

  if (!readConfigFile()) 
  {
    mylog("Failed to read configuration file, using default values\n");
  }

  //readXmlFromFS();
  
  displayLcdScreen();
  displayOledScreen();
  wifiStart();

  mylog("\nConnected!\n");
  digitalWrite(LED_BUILTIN, LOW);
  serverStart();
  mylog("Server Started.\n");

  displayOledScreen(NULL, NULL, "waiting for PAS-X...");
  displayLcdScreen(NULL, NULL, "waiting for PAS-X...");

  lastPasXInteraction = millis(); // Watch dog timer starts now
}


unsigned long nextSensorRead    = SENSORREADINTERVAL;
unsigned long nextDisplayUpdate = DISPLAYUPDATEINTERVAL;
void loop() 
{
  heap_caps_check_integrity_all(true);

  // waiting for PAS-X to start polling
  if (!setupComplete)
  {
    if (lastGetNextMessage || lastPostMessage) // did PAS-X send a message?
    {
      mylog("Setup complete!\n");
      setupComplete = true;
      if (myType == eRoomLabel)
      {
        roomLabel.readLcdFile();
        displayLcdScreen();
      }
      else if (myType == epH)
      {
        pHMeter.readConfig();
      }
      else // don't know who I am... :(
      {
        displayLcdScreen((String)"", (String)"", (String)"", "No sensor found!    ", true);
      }
    }
  }
  else // setup IS complete, PAS-X responded, check sensors in intervalls.
  {
    if (millis() > nextSensorRead) 
    {

      nextSensorRead = millis() + SENSORREADINTERVAL;

      if (myType == eRoomLabel)
      { 
        if (readSensor()) // also reads pH
        {
          displayLcdScreen(); // #todo: necessary?
        }
        else if (dhtExists) // DHT sensor but no reading? Try again faster.
        {
          nextSensorRead = millis() + SENSORREADINTERVAL/10;
        }


        mylog(humidity);
        mylog("RH, ");
        mylog(temperature);
        mylog("C\n");
        if ((!(roomLabel.rhUpperLimit==0 && roomLabel.rhLowerLimit==0) //ignore if both limits are 0.0
        &&  (humidity > roomLabel.rhUpperLimit || humidity<roomLabel.rhLowerLimit))
          ||
          (!(roomLabel.tempUpperLimit==0 && roomLabel.tempLowerLimit==0) //ignore if both limits are 0.0
        &&  (temperature > roomLabel.tempUpperLimit || temperature<roomLabel.tempLowerLimit)))
        {

          String batchID = roomLabel.lastBatchId;
          String PU      = roomLabel.lastPU;
          mylog("Exception level reached\n");
         
          if (roomLabel.systemId.length() && (batchID != lastExceptionBatchID || (millis() - lastExceptionSent>exceptionSendInterval)))
          {
            lastExceptionSent = millis();
            lastExceptionBatchID = batchID;
            String timeStampString = getUTC();

            String userDescription;
            if (!(roomLabel.rhUpperLimit==0 && roomLabel.rhLowerLimit==0))
            {
              if (humidity > roomLabel.rhUpperLimit || humidity<roomLabel.rhLowerLimit)
              { 
                userDescription += "Humidity is outside the limit (" + String(roomLabel.rhLowerLimit) + "-" 
                                  + String(roomLabel.rhUpperLimit) + "RH%). Current humidity is " + String(humidity) + "RH%\n";
              }
            }
            if (!(roomLabel.tempUpperLimit==0 && roomLabel.tempLowerLimit==0))
            {
              if (temperature > roomLabel.tempUpperLimit || temperature<roomLabel.tempLowerLimit)
              {
                userDescription += "Temperature is outside the limit (" + String(roomLabel.tempLowerLimit) + "-" 
                                + String(roomLabel.tempUpperLimit) + "C). Current temperature is " + String(temperature) + "C";
              }
            }
            String systemDesciption;
            String exceptionMessage = ExceptionMessage::getExceptionMessageText(roomLabel.systemId.c_str(), 
                                                                                "",//batchID.c_str(), 
                                                                                PU.c_str(),
                                                                                "Sensor data outside of limits", 
                                                                                userDescription.c_str(), 
                                                                                timeStampString.c_str());
            mylog(exceptionMessage);
            if (displayLcd)
            {
              displayLcd->setBacklight(!roomLabel.getEnabled());
              delay(100);
              displayLcd->setBacklight(roomLabel.getEnabled());
            }

