HenrikSte/esp32msi/src/main.cpp
            sendQueue.push(exceptionMessage);
          }
        }
      }
      else if (myType == epH)
      {
        float pH = pHMeter.getpH();
        mylog(pH);
        mylog("pH\n");
        if ( pHMeter.upperLimit > pHMeter.lowerLimit 
        &&  (pH > pHMeter.upperLimit || pH<pHMeter.lowerLimit)
        &&  (millis() - lastExceptionSent>exceptionSendInterval))
        {
            String batchID = pHMeter.lastBatchId;
            lastExceptionSent = millis();
            String timeStampString = getUTC();

            String userDescription;
            userDescription += "pH value is outside the limit (" + String(pHMeter.lowerLimit) + "-" 
                              + String(pHMeter.upperLimit) + "pH). Current pH is " + String(pH) + "pH\n";
            String systemDesciption;
            String exceptionMessage = ExceptionMessage::getExceptionMessageText(pHMeter.systemId.c_str(), 
                                                                                batchID.c_str(), 
                                                                                "",//PU.c_str(),
                                                                                "System Description", 
                                                                                userDescription.c_str(), 
                                                                                timeStampString.c_str());
            mylog(exceptionMessage);

            sendQueue.push(exceptionMessage);
        }

      }
    }

    if (millis() > nextDisplayUpdate)
    {
      nextDisplayUpdate = millis() + DISPLAYUPDATEINTERVAL;
      displayOledScreen();
    }

  }
  
  if (!digitalRead(TRIGGER_PIN1))
  {
    Serial.print("1");
  }
  if (!digitalRead(TRIGGER_PIN2))
  {
    Serial.print("2");
  }
  
  if (millis() - lastPasXInteraction > pasXWatchDogTime)
  {
    mylog("\n############################################################################\n");
    mylog(getNow());
    mylog("################################ watchdog reset ############################\n");
    mylog("############################################################################\n", true);
    delay(100);
    ESP.restart();
  }


  // Check if WLAN is connected
  if (WiFi.status() != WL_CONNECTED)
  {   
    mylog("reconnecting...\n");
    WiFi.reconnect();
    if (WiFi.status() == WL_CONNECTED)
    {
      mylog("reconnected!\n");
    }
    else
    {
      delay(250);
    }
  }
  server.handleClient();
}

